[
    {
      "name": "Thorin Oakenshield",
      "description": "Thorin II, also called the Oakenshield, King under the Mountain or the Mountain King, was the son of Thráin II, the older brother of Frerin and Dís, the grandson of King Thrór and the uncle of Fíli and Kíli. Thorin was best known for his deeds as leader of a company that infiltrated the lost Kingdom under the Mountain to take it back from Smaug and for leading an alliance of Men, Dwarves, and Elves in the Battle of the Five Armies.",
      "image_source": "http://www.panhistoria.com/Stacks/Novels/characterimages/T27293.jpg"
    },
    {
      "name": "Kili & Fili",
      "description": "Fíli and Kíli were the two most active dwarves of Thorin's company, and apart from Balin, and possibly Bombur, they appeared more frequently as 'individual' characters in Tolkien's novel than the rest of Thorin's companions, who were most often named only in 'group' references to the entire company.",
      "image_source": "http://www.filmofilia.com/wp-content/uploads/2011/07/hobbit_0.jpg"
    },
    {
        "name": "Óin",
        "description": "Óin fought in the Battle of Azanulbizar along with Thorin Oakenshield, and in TA 2941 joined Thorin's company on the quest to reclaim the Lonely Mountain, wearing a brown hood.[2] Óin was one of the Dwarves who bet that Bilbo would come along with them to reclaim the Lonely Mountain. Óin and his brother Glóin were usually in charge of preparing the fire for the Company, as they were the most skilled of the group. He fought in and survived the Battle of Five Armies, and later settled in the Lonely Mountain with King Dáin II Ironfoot, along with many other Dwarves of the company of Thorin.",
        "image_source": "https://static.wikia.nocookie.net/lotr/images/4/4b/Oinstaff.jpg"
    },
    {
        "name": "Glóin",
        "description": "In TA 2799, Glóin was known to have fought in the Battle of Azanulbizar, the last battle of the War of the Dwarves and Orcs, though it is unknown how significant his contribution was, being 16 years old.<br> In TA 2879, in the Blue Mountains, while in exile, his son Gimli was born to him and an unknown wife. In March of TA 2941 in Bree, Thorin Oakenshield met by chance the wizard Gandalf the Grey, pushing Thorin to reclaim Erebor, so that Smaug wouldn't ally with Sauron. When Gandalf mentioned Hobbits, Glóin referred them as 'simpletons' and also said that Hobbits 'would never dare to come within smelling distance of the nakedest dragonet new from the shell'.",
        "image_source": "https://static.wikia.nocookie.net/lotr/images/f/fc/Gloin_2.jpg"
      }
  ]